scc2425-tukano/src/main/test/scc2425-artillery-tests/realistic_flow_out.txt
Test run id: th9qp_myzxcjd6n69w3376cn6pbzdxm6mzg_7jw9
Parsed 201 rows
Parsed 201 rows
Parsed 201 rows
[...]
Phase started: Warm up (index: 0, duration: 10s) 01:20:22(+0000)

Phase completed: Warm up (index: 0, duration: 10s) 01:20:32(+0000)

--------------------------------------
Metrics for period to: 01:20:30(+0000) (width: 6.338s)
--------------------------------------

http.codes.200: ................................................................ 10
http.codes.204: ................................................................ 1
http.codes.403: ................................................................ 2
http.codes.404: ................................................................ 3
http.downloaded_bytes: ......................................................... 171
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 18
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 3816
  mean: ........................................................................ 1021.1
  median: ...................................................................... 407.5
  p95: ......................................................................... 3328.3
  p99: ......................................................................... 3328.3
http.response_time.2xx:
  min: ......................................................................... 240
  max: ......................................................................... 3816
  mean: ........................................................................ 1280.5
  median: ...................................................................... 432.7
  p95: ......................................................................... 3328.3
  p99: ......................................................................... 3328.3
http.response_time.4xx:
  min: ......................................................................... 2
  max: ......................................................................... 967
  mean: ........................................................................ 450.4
  median: ...................................................................... 407.5
  p95: ......................................................................... 596
  p99: ......................................................................... 596
http.responses: ................................................................ 16
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.403: ........ 2
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ shortId }}.codes.404: ....... 2
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ shortId }}/{{ userId }}/l...  1
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}/feed?pwd={{ pwd...  8
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}/shorts.codes.200: . 2
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId1 }}/{{ userId2 }}/...  1
plugins.metrics-by-endpoint.response_time./tukano/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 2
  max: ......................................................................... 276
  mean: ........................................................................ 139
  median: ...................................................................... 2
  p95: ......................................................................... 2
  p99: ......................................................................... 2
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ shortId }}:
  min: ......................................................................... 598
  max: ......................................................................... 967
  mean: ........................................................................ 782.5
  median: ...................................................................... 596
  p95: ......................................................................... 596
  p99: ......................................................................... 596
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ shortId }}/{{ userId }}/likes?pwd={{ pwd }}:
  min: ......................................................................... 409
  max: ......................................................................... 409
  mean: ........................................................................ 409
  median: ...................................................................... 407.5
  p95: ......................................................................... 407.5
  p99: ......................................................................... 407.5
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}/feed?pwd={{ pwd }}:
  min: ......................................................................... 240
  max: ......................................................................... 3310
  mean: ........................................................................ 1035.5
  median: ...................................................................... 295.9
  p95: ......................................................................... 2416.8
  p99: ......................................................................... 2416.8
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}/shorts:
  min: ......................................................................... 1553
  max: ......................................................................... 3816
  mean: ........................................................................ 2684.5
  median: ...................................................................... 1556.5
  p95: ......................................................................... 1556.5
  p99: ......................................................................... 1556.5
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId1 }}/{{ userId2 }}/followers?pwd={{ pwd }}:
  min: ......................................................................... 432
  max: ......................................................................... 432
  mean: ........................................................................ 432
  median: ...................................................................... 432.7
  p95: ......................................................................... 432.7
  p99: ......................................................................... 432.7
vusers.completed: .............................................................. 14
vusers.created: ................................................................ 16
vusers.created_by_name.Download short: ......................................... 2
vusers.created_by_name.Follow user: ............................................ 1
vusers.created_by_name.Get User Follows: ....................................... 1
vusers.created_by_name.Get User's Shorts: ...................................... 3
vusers.created_by_name.Like short: ............................................. 1
vusers.created_by_name.View feed: .............................................. 8
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 243
  max: ......................................................................... 3819.9
  mean: ........................................................................ 1173.6
  median: ...................................................................... 432.7
  p95: ......................................................................... 3328.3
  p99: ......................................................................... 3328.3


--------------------------------------
Metrics for period to: 01:20:40(+0000) (width: 3.572s)
--------------------------------------

http.codes.200: ................................................................ 11
http.codes.204: ................................................................ 3
http.codes.403: ................................................................ 3
http.codes.404: ................................................................ 5
http.downloaded_bytes: ......................................................... 78695
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 20
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 785
  mean: ........................................................................ 349
  median: ...................................................................... 301.9
  p95: ......................................................................... 658.6
  p99: ......................................................................... 713.5
http.response_time.2xx:
  min: ......................................................................... 170
  max: ......................................................................... 785
  mean: ........................................................................ 379.8
  median: ...................................................................... 290.1
  p95: ......................................................................... 713.5
  p99: ......................................................................... 713.5
http.response_time.4xx:
  min: ......................................................................... 2
  max: ......................................................................... 593
  mean: ........................................................................ 295
  median: ...................................................................... 399.5
  p95: ......................................................................... 550.1
  p99: ......................................................................... 550.1
http.responses: ................................................................ 22
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.200: ........ 1
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.204: ........ 2
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.403: ........ 3
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ shortId }}.codes.200: ....... 1
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ shortId }}.codes.404: ....... 3
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ shortId }}/likes?pwd={{ p...  1
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ shortId }}/{{ userId }}/l...  1
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ shortId }}/{{ userId }}/l...  1
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}/feed?pwd={{ pwd...  5
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}/followers?pwd={...  1
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}/shorts.codes.200: . 1
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}.c...  2
plugins.metrics-by-endpoint.response_time./tukano/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 2
  max: ......................................................................... 707
  mean: ........................................................................ 195.7
  median: ...................................................................... 3
  p95: ......................................................................... 290.1
  p99: ......................................................................... 290.1
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ shortId }}:
  min: ......................................................................... 399
  max: ......................................................................... 593
  mean: ........................................................................ 450.5
  median: ...................................................................... 399.5
  p95: ......................................................................... 407.5
  p99: ......................................................................... 407.5
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ shortId }}/likes?pwd={{ pwd }}:
  min: ......................................................................... 554
  max: ......................................................................... 554
  mean: ........................................................................ 554
  median: ...................................................................... 550.1
  p95: ......................................................................... 550.1
  p99: ......................................................................... 550.1
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ shortId }}/{{ userId }}/likes?pwd={{ pwd }}:
  min: ......................................................................... 396
  max: ......................................................................... 785
  mean: ........................................................................ 590.5
  median: ...................................................................... 399.5
  p95: ......................................................................... 399.5
  p99: ......................................................................... 399.5
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}/feed?pwd={{ pwd }}:
  min: ......................................................................... 241
  max: ......................................................................... 255
  mean: ........................................................................ 247.8
  median: ...................................................................... 247.2
  p95: ......................................................................... 252.2
  p99: ......................................................................... 252.2
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}/followers?pwd={{ pwd }}:
  min: ......................................................................... 302
  max: ......................................................................... 302
  mean: ........................................................................ 302
  median: ...................................................................... 301.9
  p95: ......................................................................... 301.9
  p99: ......................................................................... 301.9
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}/shorts:
  min: ......................................................................... 313
  max: ......................................................................... 313
  mean: ........................................................................ 313
  median: ...................................................................... 314.2
  p95: ......................................................................... 314.2
  p99: ......................................................................... 314.2
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 453
  max: ......................................................................... 659
  mean: ........................................................................ 556
  median: ...................................................................... 450.4
  p95: ......................................................................... 450.4
  p99: ......................................................................... 450.4
vusers.completed: .............................................................. 16
vusers.created: ................................................................ 14
vusers.created_by_name.Download short: ......................................... 4
vusers.created_by_name.Get Short Likes: ........................................ 1
vusers.created_by_name.Like short: ............................................. 2
vusers.created_by_name.Upload short: ........................................... 2
vusers.created_by_name.View feed: .............................................. 5
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 244.3
  max: ......................................................................... 1372.2
  mean: ........................................................................ 486
  median: ...................................................................... 399.5
  p95: ......................................................................... 788.5
  p99: ......................................................................... 788.5


All VUs finished. Total time: 12 seconds

--------------------------------
Summary report @ 01:20:35(+0000)
--------------------------------

http.codes.200: ................................................................ 21
http.codes.204: ................................................................ 4
http.codes.403: ................................................................ 5
http.codes.404: ................................................................ 8
http.downloaded_bytes: ......................................................... 78866
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 38
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 3816
  mean: ........................................................................ 631.9
  median: ...................................................................... 314.2
  p95: ......................................................................... 2416.8
  p99: ......................................................................... 3328.3
http.response_time.2xx:
  min: ......................................................................... 170
  max: ......................................................................... 3816
  mean: ........................................................................ 776.1
  median: ...................................................................... 308
  p95: ......................................................................... 2416.8
  p99: ......................................................................... 3328.3
http.response_time.4xx:
  min: ......................................................................... 2
  max: ......................................................................... 967
  mean: ........................................................................ 354.8
  median: ...................................................................... 399.5
  p95: ......................................................................... 596
  p99: ......................................................................... 596
http.responses: ................................................................ 38
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.200: ........ 1
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.204: ........ 2
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.403: ........ 5
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ shortId }}.codes.200: ....... 1
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ shortId }}.codes.404: ....... 5
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ shortId }}/likes?pwd={{ p...  1
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ shortId }}/{{ userId }}/l...  1
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ shortId }}/{{ userId }}/l...  2
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}/feed?pwd={{ pwd...  13
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}/followers?pwd={...  1
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}/shorts.codes.200: . 3
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}.c...  2
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId1 }}/{{ userId2 }}/...  1
plugins.metrics-by-endpoint.response_time./tukano/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 2
  max: ......................................................................... 707
  mean: ........................................................................ 181.5
  median: ...................................................................... 3
  p95: ......................................................................... 290.1
  p99: ......................................................................... 290.1
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ shortId }}:
  min: ......................................................................... 399
  max: ......................................................................... 967
  mean: ........................................................................ 561.2
  median: ...................................................................... 407.5
  p95: ......................................................................... 596
  p99: ......................................................................... 596
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ shortId }}/likes?pwd={{ pwd }}:
  min: ......................................................................... 554
  max: ......................................................................... 554
  mean: ........................................................................ 554
  median: ...................................................................... 550.1
  p95: ......................................................................... 550.1
  p99: ......................................................................... 550.1
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ shortId }}/{{ userId }}/likes?pwd={{ pwd }}:
  min: ......................................................................... 396
  max: ......................................................................... 785
  mean: ........................................................................ 530
  median: ...................................................................... 407.5
  p95: ......................................................................... 407.5
  p99: ......................................................................... 407.5
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}/feed?pwd={{ pwd }}:
  min: ......................................................................... 240
  max: ......................................................................... 3310
  mean: ........................................................................ 732.5
  median: ...................................................................... 257.3
  p95: ......................................................................... 2416.8
  p99: ......................................................................... 2416.8
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}/followers?pwd={{ pwd }}:
  min: ......................................................................... 302
  max: ......................................................................... 302
  mean: ........................................................................ 302
  median: ...................................................................... 301.9
  p95: ......................................................................... 301.9
  p99: ......................................................................... 301.9
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}/shorts:
  min: ......................................................................... 313
  max: ......................................................................... 3816
  mean: ........................................................................ 1894
  median: ...................................................................... 1556.5
  p95: ......................................................................... 1556.5
  p99: ......................................................................... 1556.5
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 453
  max: ......................................................................... 659
  mean: ........................................................................ 556
  median: ...................................................................... 450.4
  p95: ......................................................................... 450.4
  p99: ......................................................................... 450.4
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId1 }}/{{ userId2 }}/followers?pwd={{ pwd }}:
  min: ......................................................................... 432
  max: ......................................................................... 432
  mean: ........................................................................ 432
  median: ...................................................................... 432.7
  p95: ......................................................................... 432.7
  p99: ......................................................................... 432.7
vusers.completed: .............................................................. 30
vusers.created: ................................................................ 30
vusers.created_by_name.Download short: ......................................... 6
vusers.created_by_name.Follow user: ............................................ 1
vusers.created_by_name.Get Short Likes: ........................................ 1
vusers.created_by_name.Get User Follows: ....................................... 1
vusers.created_by_name.Get User's Shorts: ...................................... 3
vusers.created_by_name.Like short: ............................................. 3
vusers.created_by_name.Upload short: ........................................... 2
vusers.created_by_name.View feed: .............................................. 13
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 243
  max: ......................................................................... 3819.9
  mean: ........................................................................ 806.9
  median: ...................................................................... 415.8
  p95: ......................................................................... 2416.8
  p99: ......................................................................... 3328.3